package ru.levelp;
import java.util.Scanner;
/**
 * Created by Weisekopf on 04.04.16.
 */

/*
    ДЗ
    Написать калькулятор по такому алгоритму:
    1) Пользователь вводит первое число
    2) Пользователь вводит операцию (+ - * / % ^)
    3) Пользователь вводит второе число и ему выводится результат
    *) Если сначала вводится не число, а функция (sqrt, log, ln, lg, sin, cos, tan, atan),
       то следом вводится число и вычисляется функция от введенного числа
       sin(5) = ...
     */

public class Main {
    public static void main(String[] args) {




    }
}
